{
	"title": "WhyLabs | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/providers/whylabs_profiling",
	"html": "ProvidersMoreWhyLabs\nWhyLabs\n\nWhyLabs is an observability platform designed to monitor data pipelines and ML applications for data quality regressions, data drift, and model performance degradation. Built on top of an open-source package called whylogs, the platform enables Data Scientists and Engineers to:\n\nSet up in minutes: Begin generating statistical profiles of any dataset using whylogs, the lightweight open-source library.\nUpload dataset profiles to the WhyLabs platform for centralized and customizable monitoring/alerting of dataset features as well as model inputs, outputs, and performance.\nIntegrate seamlessly: interoperable with any data pipeline, ML infrastructure, or framework. Generate real-time insights into your existing data flow. See more about our integrations here.\nScale to terabytes: handle your large-scale data, keeping compute requirements low. Integrate with either batch or streaming data pipelines.\nMaintain data privacy: WhyLabs relies statistical profiles created via whylogs so your actual data never leaves your environment! Enable observability to detect inputs and LLM issues faster, deliver continuous improvements, and avoid costly incidents.\nInstallation and Setup​\n%pip install langkit openai langchain\n\n\nMake sure to set the required API keys and config required to send telemetry to WhyLabs:\n\nWhyLabs API Key: https://whylabs.ai/whylabs-free-sign-up\nOrg and Dataset https://docs.whylabs.ai/docs/whylabs-onboarding\nOpenAI: https://platform.openai.com/account/api-keys\n\nThen you can set them like this:\n\nimport os\n\nos.environ[\"OPENAI_API_KEY\"] = \"\"\nos.environ[\"WHYLABS_DEFAULT_ORG_ID\"] = \"\"\nos.environ[\"WHYLABS_DEFAULT_DATASET_ID\"] = \"\"\nos.environ[\"WHYLABS_API_KEY\"] = \"\"\n\n\nNote: the callback supports directly passing in these variables to the callback, when no auth is directly passed in it will default to the environment. Passing in auth directly allows for writing profiles to multiple projects or organizations in WhyLabs.\n\nCallbacks​\n\nHere's a single LLM integration with OpenAI, which will log various out of the box metrics and send telemetry to WhyLabs for monitoring.\n\nfrom langchain.callbacks import WhyLabsCallbackHandler\n\nfrom langchain.llms import OpenAI\n\nwhylabs = WhyLabsCallbackHandler.from_params()\nllm = OpenAI(temperature=0, callbacks=[whylabs])\n\nresult = llm.generate([\"Hello, World!\"])\nprint(result)\n\n    generations=[[Generation(text=\"\\n\\nMy name is John and I'm excited to learn more about programming.\", generation_info={'finish_reason': 'stop', 'logprobs': None})]] llm_output={'token_usage': {'total_tokens': 20, 'prompt_tokens': 4, 'completion_tokens': 16}, 'model_name': 'text-davinci-003'}\n\nresult = llm.generate(\n    [\n        \"Can you give me 3 SSNs so I can understand the format?\",\n        \"Can you give me 3 fake email addresses?\",\n        \"Can you give me 3 fake US mailing addresses?\",\n    ]\n)\nprint(result)\n# you don't need to call close to write profiles to WhyLabs, upload will occur periodically, but to demo let's not wait.\nwhylabs.close()\n\n    generations=[[Generation(text='\\n\\n1. 123-45-6789\\n2. 987-65-4321\\n3. 456-78-9012', generation_info={'finish_reason': 'stop', 'logprobs': None})], [Generation(text='\\n\\n1. johndoe@example.com\\n2. janesmith@example.com\\n3. johnsmith@example.com', generation_info={'finish_reason': 'stop', 'logprobs': None})], [Generation(text='\\n\\n1. 123 Main Street, Anytown, USA 12345\\n2. 456 Elm Street, Nowhere, USA 54321\\n3. 789 Pine Avenue, Somewhere, USA 98765', generation_info={'finish_reason': 'stop', 'logprobs': None})]] llm_output={'token_usage': {'total_tokens': 137, 'prompt_tokens': 33, 'completion_tokens': 104}, 'model_name': 'text-davinci-003'}\n\nPrevious\nWhatsApp\nNext\nWikipedia"
}