{
	"title": "Momento | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/providers/momento",
	"html": "ProvidersMoreMomento\nMomento\n\nMomento Cache is the world's first truly serverless caching service, offering instant elasticity, scale-to-zero capability, and blazing-fast performance.\n\nMomento Vector Index stands out as the most productive, easiest-to-use, fully serverless vector index.\n\nFor both services, simply grab the SDK, obtain an API key, input a few lines into your code, and you're set to go. Together, they provide a comprehensive solution for your LLM data needs.\n\nThis page covers how to use the Momento ecosystem within LangChain.\n\nInstallation and Setup​\nSign up for a free account here to get an API key\nInstall the Momento Python SDK with pip install momento\nCache​\n\nUse Momento as a serverless, distributed, low-latency cache for LLM prompts and responses. The standard cache is the primary use case for Momento users in any environment.\n\nTo integrate Momento Cache into your application:\n\nfrom langchain.cache import MomentoCache\n\n\nThen, set it up with the following code:\n\nfrom datetime import timedelta\nfrom momento import CacheClient, Configurations, CredentialProvider\nfrom langchain.globals import set_llm_cache\n\n# Instantiate the Momento client\ncache_client = CacheClient(\n    Configurations.Laptop.v1(),\n    CredentialProvider.from_environment_variable(\"MOMENTO_API_KEY\"),\n    default_ttl=timedelta(days=1))\n\n# Choose a Momento cache name of your choice\ncache_name = \"langchain\"\n\n# Instantiate the LLM cache\nset_llm_cache(MomentoCache(cache_client, cache_name))\n\nMemory​\n\nMomento can be used as a distributed memory store for LLMs.\n\nChat Message History Memory​\n\nSee this notebook for a walkthrough of how to use Momento as a memory store for chat message history.\n\nVector Store​\n\nMomento Vector Index (MVI) can be used as a vector store.\n\nSee this notebook for a walkthrough of how to use MVI as a vector store.\n\nPrevious\nModern Treasury\nNext\nMongoDB Atlas"
}