{
	"title": "Google Translate | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/document_transformers/google_translate",
	"html": "ComponentsDocument transformersGoogle Translate\nGoogle Translate\n\nGoogle Translate is a multilingual neural machine translation service developed by Google to translate text, documents and websites from one language into another.\n\nThe GoogleTranslateTransformer allows you to translate text and HTML with the Google Cloud Translation API.\n\nTo use it, you should have the google-cloud-translate python package installed, and a Google Cloud project with the Translation API enabled. This transformer uses the Advanced edition (v3).\n\nGoogle Neural Machine Translation\nA Neural Network for Machine Translation, at Production Scale\npip install google-cloud-translate\n\nfrom langchain.document_transformers import GoogleTranslateTransformer\nfrom langchain.schema import Document\n\nInput​\n\nThis is the document we'll translate\n\nsample_text = \"\"\"[Generated with Google Bard]\nSubject: Key Business Process Updates\n\nDate: Friday, 27 October 2023\n\nDear team,\n\nI am writing to provide an update on some of our key business processes.\n\nSales process\n\nWe have recently implemented a new sales process that is designed to help us close more deals and grow our revenue. The new process includes a more rigorous qualification process, a more streamlined proposal process, and a more effective customer relationship management (CRM) system.\n\nMarketing process\n\nWe have also revamped our marketing process to focus on creating more targeted and engaging content. We are also using more social media and paid advertising to reach a wider audience.\n\nCustomer service process\n\nWe have also made some improvements to our customer service process. We have implemented a new customer support system that makes it easier for customers to get help with their problems. We have also hired more customer support representatives to reduce wait times.\n\nOverall, we are very pleased with the progress we have made on improving our key business processes. We believe that these changes will help us to achieve our goals of growing our business and providing our customers with the best possible experience.\n\nIf you have any questions or feedback about any of these changes, please feel free to contact me directly.\n\nThank you,\n\nLewis Cymbal\nCEO, Cymbal Bank\n\"\"\"\n\n\nWhen initializing the GoogleTranslateTransformer, you can include the following parameters to configure the requests.\n\nproject_id: Google Cloud Project ID.\nlocation: (Optional) Translate model location.\nDefault: global\nmodel_id: (Optional) Translate model ID to use.\nglossary_id: (Optional) Translate glossary ID to use.\napi_endpoint: (Optional) Regional endpoint to use.\ndocuments = [Document(page_content=sample_text)]\ntranslator = GoogleTranslateTransformer(project_id=\"<YOUR_PROJECT_ID>\")\n\nOutput​\n\nAfter translating a document, the result will be returned as a new document with the page_content translated into the target language.\n\nYou can provide the following keyword parameters to the transform_documents() method:\n\ntarget_language_code: ISO 639 language code of the output document.\nFor supported languages, refer to Language support.\nsource_language_code: (Optional) ISO 639 language code of the input document.\nIf not provided, language will be auto-detected.\nmime_type: (Optional) Media Type of the input text.\nOptions: text/plain (Default), text/html.\ntranslated_documents = translator.transform_documents(\n    documents, target_language_code=\"es\"\n)\n\nfor doc in translated_documents:\n    print(doc.metadata)\n    print(doc.page_content)\n\n    {'model': '', 'detected_language_code': 'en'}\n    [Generado con Google Bard]\n    Asunto: Actualizaciones clave de procesos comerciales\n    \n    Fecha: viernes 27 de octubre de 2023\n    \n    Estimado equipo,\n    \n    Le escribo para brindarle una actualización sobre algunos de nuestros procesos comerciales clave.\n    \n    Proceso de ventas\n    \n    Recientemente implementamos un nuevo proceso de ventas que está diseñado para ayudarnos a cerrar más acuerdos y aumentar nuestros ingresos. El nuevo proceso incluye un proceso de calificación más riguroso, un proceso de propuesta más simplificado y un sistema de gestión de relaciones con el cliente (CRM) más eficaz.\n    \n    Proceso de mercadeo\n    \n    También hemos renovado nuestro proceso de marketing para centrarnos en crear contenido más específico y atractivo. También estamos utilizando más redes sociales y publicidad paga para llegar a una audiencia más amplia.\n    \n    proceso de atención al cliente\n    \n    También hemos realizado algunas mejoras en nuestro proceso de atención al cliente. Hemos implementado un nuevo sistema de atención al cliente que facilita que los clientes obtengan ayuda con sus problemas. También hemos contratado más representantes de atención al cliente para reducir los tiempos de espera.\n    \n    En general, estamos muy satisfechos con el progreso que hemos logrado en la mejora de nuestros procesos comerciales clave. Creemos que estos cambios nos ayudarán a lograr nuestros objetivos de hacer crecer nuestro negocio y brindar a nuestros clientes la mejor experiencia posible.\n    \n    Si tiene alguna pregunta o comentario sobre cualquiera de estos cambios, no dude en ponerse en contacto conmigo directamente.\n    \n    Gracias,\n    \n    Platillo Lewis\n    Director ejecutivo, banco de platillos\n    \n\nPrevious\nDoctran: language translation\nNext\nHTML to text"
}