{
	"title": "Recursive URL | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/document_loaders/recursive_url",
	"html": "ComponentsDocument loadersRecursive URL\nRecursive URL\n\nWe may want to process load all URLs under a root directory.\n\nFor example, let's look at the Python 3.9 Document.\n\nThis has many interesting child pages that we may want to read in bulk.\n\nOf course, the WebBaseLoader can load a list of pages.\n\nBut, the challenge is traversing the tree of child pages and actually assembling that list!\n\nWe do this using the RecursiveUrlLoader.\n\nThis also gives us the flexibility to exclude some children, customize the extractor, and more.\n\nParameters\nurl: str, the target url to crawl.\nexclude_dirs: Optional[str], webpage directories to exclude.\nuse_async: Optional[bool], wether to use async requests, using async requests is usually faster in large tasks. However, async will disable the lazy loading feature(the function still works, but it is not lazy). By default, it is set to False.\nextractor: Optional[Callable[[str], str]], a function to extract the text of the document from the webpage, by default it returns the page as it is. It is recommended to use tools like goose3 and beautifulsoup to extract the text. By default, it just returns the page as it is.\nmax_depth: Optional[int] = None, the maximum depth to crawl. By default, it is set to 2. If you need to crawl the whole website, set it to a number that is large enough would simply do the job.\ntimeout: Optional[int] = None, the timeout for each request, in the unit of seconds. By default, it is set to 10.\nprevent_outside: Optional[bool] = None, whether to prevent crawling outside the root url. By default, it is set to True.\nfrom langchain.document_loaders.recursive_url_loader import RecursiveUrlLoader\n\n\nLet's try a simple example.\n\nfrom bs4 import BeautifulSoup as Soup\n\nurl = \"https://docs.python.org/3.9/\"\nloader = RecursiveUrlLoader(\n    url=url, max_depth=2, extractor=lambda x: Soup(x, \"html.parser\").text\n)\ndocs = loader.load()\n\ndocs[0].page_content[:50]\n\n    '\\n\\n\\n\\n\\nPython Frequently Asked Questions — Python 3.'\n\ndocs[-1].metadata\n\n    {'source': 'https://docs.python.org/3.9/library/index.html',\n     'title': 'The Python Standard Library — Python 3.9.17 documentation',\n     'language': None}\n\n\nHowever, since it's hard to perform a perfect filter, you may still see some irrelevant results in the results. You can perform a filter on the returned documents by yourself, if it's needed. Most of the time, the returned results are good enough.\n\nTesting on LangChain docs.\n\nurl = \"https://js.langchain.com/docs/modules/memory/integrations/\"\nloader = RecursiveUrlLoader(url=url)\ndocs = loader.load()\nlen(docs)\n\n    8\n\nPrevious\nReadTheDocs Documentation\nNext\nReddit"
}