{
	"title": "Parent Document Retriever | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/modules/data_connection/retrievers/parent_document_retriever",
	"html": "ModulesRetrievalRetrieversParent Document Retriever\nParent Document Retriever\n\nWhen splitting documents for retrieval, there are often conflicting desires:\n\nYou may want to have small documents, so that their embeddings can most accurately reflect their meaning. If too long, then the embeddings can lose meaning.\nYou want to have long enough documents that the context of each chunk is retained.\n\nThe ParentDocumentRetriever strikes that balance by splitting and storing small chunks of data. During retrieval, it first fetches the small chunks but then looks up the parent ids for those chunks and returns those larger documents.\n\nNote that \"parent document\" refers to the document that a small chunk originated from. This can either be the whole raw document OR a larger chunk.\n\nfrom langchain.retrievers import ParentDocumentRetriever\n\nfrom langchain.document_loaders import TextLoader\nfrom langchain.embeddings import OpenAIEmbeddings\nfrom langchain.storage import InMemoryStore\nfrom langchain.text_splitter import RecursiveCharacterTextSplitter\nfrom langchain.vectorstores import Chroma\n\nloaders = [\n    TextLoader(\"../../paul_graham_essay.txt\"),\n    TextLoader(\"../../state_of_the_union.txt\"),\n]\ndocs = []\nfor l in loaders:\n    docs.extend(l.load())\n\nRetrieving full documents​\n\nIn this mode, we want to retrieve the full documents. Therefore, we only specify a child splitter.\n\n# This text splitter is used to create the child documents\nchild_splitter = RecursiveCharacterTextSplitter(chunk_size=400)\n# The vectorstore to use to index the child chunks\nvectorstore = Chroma(\n    collection_name=\"full_documents\", embedding_function=OpenAIEmbeddings()\n)\n# The storage layer for the parent documents\nstore = InMemoryStore()\nretriever = ParentDocumentRetriever(\n    vectorstore=vectorstore,\n    docstore=store,\n    child_splitter=child_splitter,\n)\n\nretriever.add_documents(docs, ids=None)\n\n\nThis should yield two keys, because we added two documents.\n\nlist(store.yield_keys())\n\n    ['05fe8d8a-bf60-4f87-b576-4351b23df266',\n     '571cc9e5-9ef7-4f6c-b800-835c83a1858b']\n\n\nLet's now call the vector store search functionality - we should see that it returns small chunks (since we're storing the small chunks).\n\nsub_docs = vectorstore.similarity_search(\"justice breyer\")\n\nprint(sub_docs[0].page_content)\n\n    Tonight, I’d like to honor someone who has dedicated his life to serve this country: Justice Stephen Breyer—an Army veteran, Constitutional scholar, and retiring Justice of the United States Supreme Court. Justice Breyer, thank you for your service. \n    \n    One of the most serious constitutional responsibilities a President has is nominating someone to serve on the United States Supreme Court.\n\n\nLet's now retrieve from the overall retriever. This should return large documents - since it returns the documents where the smaller chunks are located.\n\nretrieved_docs = retriever.get_relevant_documents(\"justice breyer\")\n\nlen(retrieved_docs[0].page_content)\n\n    38539\n\nRetrieving larger chunks​\n\nSometimes, the full documents can be too big to want to retrieve them as is. In that case, what we really want to do is to first split the raw documents into larger chunks, and then split it into smaller chunks. We then index the smaller chunks, but on retrieval we retrieve the larger chunks (but still not the full documents).\n\n# This text splitter is used to create the parent documents\nparent_splitter = RecursiveCharacterTextSplitter(chunk_size=2000)\n# This text splitter is used to create the child documents\n# It should create documents smaller than the parent\nchild_splitter = RecursiveCharacterTextSplitter(chunk_size=400)\n# The vectorstore to use to index the child chunks\nvectorstore = Chroma(\n    collection_name=\"split_parents\", embedding_function=OpenAIEmbeddings()\n)\n# The storage layer for the parent documents\nstore = InMemoryStore()\n\nretriever = ParentDocumentRetriever(\n    vectorstore=vectorstore,\n    docstore=store,\n    child_splitter=child_splitter,\n    parent_splitter=parent_splitter,\n)\n\nretriever.add_documents(docs)\n\n\nWe can see that there are much more than two documents now - these are the larger chunks.\n\nlen(list(store.yield_keys()))\n\n    66\n\n\nLet's make sure the underlying vector store still retrieves the small chunks.\n\nsub_docs = vectorstore.similarity_search(\"justice breyer\")\n\nprint(sub_docs[0].page_content)\n\n    Tonight, I’d like to honor someone who has dedicated his life to serve this country: Justice Stephen Breyer—an Army veteran, Constitutional scholar, and retiring Justice of the United States Supreme Court. Justice Breyer, thank you for your service. \n    \n    One of the most serious constitutional responsibilities a President has is nominating someone to serve on the United States Supreme Court.\n\nretrieved_docs = retriever.get_relevant_documents(\"justice breyer\")\n\nlen(retrieved_docs[0].page_content)\n\n    1849\n\nprint(retrieved_docs[0].page_content)\n\n    In state after state, new laws have been passed, not only to suppress the vote, but to subvert entire elections. \n    \n    We cannot let this happen. \n    \n    Tonight. I call on the Senate to: Pass the Freedom to Vote Act. Pass the John Lewis Voting Rights Act. And while you’re at it, pass the Disclose Act so Americans can know who is funding our elections. \n    \n    Tonight, I’d like to honor someone who has dedicated his life to serve this country: Justice Stephen Breyer—an Army veteran, Constitutional scholar, and retiring Justice of the United States Supreme Court. Justice Breyer, thank you for your service. \n    \n    One of the most serious constitutional responsibilities a President has is nominating someone to serve on the United States Supreme Court. \n    \n    And I did that 4 days ago, when I nominated Circuit Court of Appeals Judge Ketanji Brown Jackson. One of our nation’s top legal minds, who will continue Justice Breyer’s legacy of excellence. \n    \n    A former top litigator in private practice. A former federal public defender. And from a family of public school educators and police officers. A consensus builder. Since she’s been nominated, she’s received a broad range of support—from the Fraternal Order of Police to former judges appointed by Democrats and Republicans. \n    \n    And if we are to advance liberty and justice, we need to secure the Border and fix the immigration system. \n    \n    We can do both. At our border, we’ve installed new technology like cutting-edge scanners to better detect drug smuggling.  \n    \n    We’ve set up joint patrols with Mexico and Guatemala to catch more human traffickers.  \n    \n    We’re putting in place dedicated immigration judges so families fleeing persecution and violence can have their cases heard faster. \n    \n    We’re securing commitments and supporting partners in South and Central America to host more refugees and secure their own borders.\n\nPrevious\nMultiVector Retriever\nNext\nSelf-querying"
}