{
	"title": "AliCloud PAI EAS | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/llms/pai_eas_endpoint",
	"html": "ComponentsLLMsAliCloud PAI EAS\nAliCloud PAI EAS\n\nMachine Learning Platform for AI of Alibaba Cloud is a machine learning or deep learning engineering platform intended for enterprises and developers. It provides easy-to-use, cost-effective, high-performance, and easy-to-scale plug-ins that can be applied to various industry scenarios. With over 140 built-in optimization algorithms, Machine Learning Platform for AI provides whole-process AI engineering capabilities including data labeling (PAI-iTAG), model building (PAI-Designer and PAI-DSW), model training (PAI-DLC), compilation optimization, and inference deployment (PAI-EAS). PAI-EAS supports different types of hardware resources, including CPUs and GPUs, and features high throughput and low latency. It allows you to deploy large-scale complex models with a few clicks and perform elastic scale-ins and scale-outs in real time. It also provides a comprehensive O&M and monitoring system.\n\nfrom langchain.chains import LLMChain\nfrom langchain.llms.pai_eas_endpoint import PaiEasEndpoint\nfrom langchain.prompts import PromptTemplate\n\ntemplate = \"\"\"Question: {question}\n\nAnswer: Let's think step by step.\"\"\"\n\nprompt = PromptTemplate(template=template, input_variables=[\"question\"])\n\n\nOne who want to use eas llms must set up eas service first. When the eas service is launched, eas_service_rul and eas_service token can be got. Users can refer to https://www.alibabacloud.com/help/en/pai/user-guide/service-deployment/ for more information,\n\nimport os\n\nos.environ[\"EAS_SERVICE_URL\"] = \"Your_EAS_Service_URL\"\nos.environ[\"EAS_SERVICE_TOKEN\"] = \"Your_EAS_Service_Token\"\nllm = PaiEasEndpoint(\n    eas_service_url=os.environ[\"EAS_SERVICE_URL\"],\n    eas_service_token=os.environ[\"EAS_SERVICE_TOKEN\"],\n)\n\nllm_chain = LLMChain(prompt=prompt, llm=llm)\n\nquestion = \"What NFL team won the Super Bowl in the year Justin Beiber was born?\"\nllm_chain.run(question)\n\n    '  Thank you for asking! However, I must respectfully point out that the question contains an error. Justin Bieber was born in 1994, and the Super Bowl was first played in 1967. Therefore, it is not possible for any NFL team to have won the Super Bowl in the year Justin Bieber was born.\\n\\nI hope this clarifies things! If you have any other questions, please feel free to ask.'\n\nPrevious\nOpenLM\nNext\nPetals"
}