{
	"title": "rspace | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/document_loaders/rspace",
	"html": "ComponentsDocument loadersrspace\nrspace\n\nThis notebook shows how to use the RSpace document loader to import research notes and documents from RSpace Electronic Lab Notebook into Langchain pipelines.\n\nTo start you'll need an RSpace account and an API key.\n\nYou can set up a free account at https://community.researchspace.com or use your institutional RSpace.\n\nYou can get an RSpace API token from your account's profile page.\n\npip install rspace_client\n\n\nIt's best to store your RSpace API key as an environment variable.\n\nRSPACE_API_KEY=<YOUR_KEY>\n\n\nYou'll also need to set the URL of your RSpace installation e.g.\n\nRSPACE_URL=https://community.researchspace.com\n\n\nIf you use these exact environment variable names, they will be detected automatically.\n\nfrom langchain.document_loaders.rspace import RSpaceLoader\n\n\nYou can import various items from RSpace:\n\nA single RSpace structured or basic document. This will map 1-1 to a Langchain document.\nA folder or noteook. All documents inside the notebook or folder are imported as Langchain documents.\nIf you have PDF files in the RSpace Gallery, these can be imported individually as well. Under the hood, Langchain's PDF loader will be used and this creates one Langchain document per PDF page.\n## replace these ids with some from your own research notes.\n## Make sure to use  global ids (with the 2 character prefix). This helps the loader know which API calls to make\n## to RSpace API.\n\nrspace_ids = [\"NB1932027\", \"FL1921314\", \"SD1932029\", \"GL1932384\"]\nfor rs_id in rspace_ids:\n    loader = RSpaceLoader(global_id=rs_id)\n    docs = loader.load()\n    for doc in docs:\n        ## the name and ID are added to the 'source' metadata property.\n        print(doc.metadata)\n        print(doc.page_content[:500])\n\n\nIf you don't want to use the environment variables as above, you can pass these into the RSpaceLoader\n\nloader = RSpaceLoader(\n    global_id=rs_id, api_key=\"MY_API_KEY\", url=\"https://my.researchspace.com\"\n)\n\nPrevious\nRockset\nNext\nRSS Feeds"
}