{
	"title": "Xorbits Inference (Xinference) | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/llms/xinference",
	"html": "ComponentsLLMsXorbits Inference (Xinference)\nXorbits Inference (Xinference)\n\nXinference is a powerful and versatile library designed to serve LLMs, speech recognition models, and multimodal models, even on your laptop. It supports a variety of models compatible with GGML, such as chatglm, baichuan, whisper, vicuna, orca, and many others. This notebook demonstrates how to use Xinference with LangChain.\n\nInstallation​\n\nInstall Xinference through PyPI:\n\n%pip install \"xinference[all]\"\n\nDeploy Xinference Locally or in a Distributed Cluster.​\n\nFor local deployment, run xinference.\n\nTo deploy Xinference in a cluster, first start an Xinference supervisor using the xinference-supervisor. You can also use the option -p to specify the port and -H to specify the host. The default port is 9997.\n\nThen, start the Xinference workers using xinference-worker on each server you want to run them on.\n\nYou can consult the README file from Xinference for more information.\n\nWrapper​\n\nTo use Xinference with LangChain, you need to first launch a model. You can use command line interface (CLI) to do so:\n\nxinference launch -n vicuna-v1.3 -f ggmlv3 -q q4_0\n\n    Model uid: 7167b2b0-2a04-11ee-83f0-d29396a3f064\n\n\nA model UID is returned for you to use. Now you can use Xinference with LangChain:\n\nfrom langchain.llms import Xinference\n\nllm = Xinference(\n    server_url=\"http://0.0.0.0:9997\", model_uid=\"7167b2b0-2a04-11ee-83f0-d29396a3f064\"\n)\n\nllm(\n    prompt=\"Q: where can we visit in the capital of France? A:\",\n    generate_config={\"max_tokens\": 1024, \"stream\": True},\n)\n\n    ' You can visit the Eiffel Tower, Notre-Dame Cathedral, the Louvre Museum, and many other historical sites in Paris, the capital of France.'\n\nIntegrate with a LLMChain​\nfrom langchain.chains import LLMChain\nfrom langchain.prompts import PromptTemplate\n\ntemplate = \"Where can we visit in the capital of {country}?\"\n\nprompt = PromptTemplate(template=template, input_variables=[\"country\"])\n\nllm_chain = LLMChain(prompt=prompt, llm=llm)\n\ngenerated = llm_chain.run(country=\"France\")\nprint(generated)\n\n    \n    A: You can visit many places in Paris, such as the Eiffel Tower, the Louvre Museum, Notre-Dame Cathedral, the Champs-Elysées, Montmartre, Sacré-Cœur, and the Palace of Versailles.\n\n\nLastly, terminate the model when you do not need to use it:\n\nxinference terminate --model-uid \"7167b2b0-2a04-11ee-83f0-d29396a3f064\"\n\nPrevious\nWriter\nNext\nYandexGPT"
}