{
	"title": "Azure OpenAI | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/llms/azure_openai",
	"html": "ComponentsLLMsAzure OpenAI\nAzure OpenAI\n\nThis notebook goes over how to use Langchain with Azure OpenAI.\n\nThe Azure OpenAI API is compatible with OpenAI's API. The openai Python package makes it easy to use both OpenAI and Azure OpenAI. You can call Azure OpenAI the same way you call OpenAI with the exceptions noted below.\n\nAPI configuration​\n\nYou can configure the openai package to use Azure OpenAI using environment variables. The following is for bash:\n\n# Set this to `azure`\nexport OPENAI_API_TYPE=azure\n# The API version you want to use: set this to `2023-05-15` for the released version.\nexport OPENAI_API_VERSION=2023-05-15\n# The base URL for your Azure OpenAI resource.  You can find this in the Azure portal under your Azure OpenAI resource.\nexport OPENAI_API_BASE=https://your-resource-name.openai.azure.com\n# The API key for your Azure OpenAI resource.  You can find this in the Azure portal under your Azure OpenAI resource.\nexport OPENAI_API_KEY=<your Azure OpenAI API key>\n\n\nAlternatively, you can configure the API right within your running Python environment:\n\nimport os\nos.environ[\"OPENAI_API_TYPE\"] = \"azure\"\n\nAzure Active Directory Authentication​\n\nThere are two ways you can authenticate to Azure OpenAI:\n\nAPI Key\nAzure Active Directory (AAD)\n\nUsing the API key is the easiest way to get started. You can find your API key in the Azure portal under your Azure OpenAI resource.\n\nHowever, if you have complex security requirements - you may want to use Azure Active Directory. You can find more information on how to use AAD with Azure OpenAI here.\n\nIf you are developing locally, you will need to have the Azure CLI installed and be logged in. You can install the Azure CLI here. Then, run az login to log in.\n\nAdd a role an Azure role assignment Cognitive Services OpenAI User scoped to your Azure OpenAI resource. This will allow you to get a token from AAD to use with Azure OpenAI. You can grant this role assignment to a user, group, service principal, or managed identity. For more information about Azure OpenAI RBAC roles see here.\n\nTo use AAD in Python with LangChain, install the azure-identity package. Then, set OPENAI_API_TYPE to azure_ad. Next, use the DefaultAzureCredential class to get a token from AAD by calling get_token as shown below. Finally, set the OPENAI_API_KEY environment variable to the token value.\n\nimport os\nfrom azure.identity import DefaultAzureCredential\n\n# Get the Azure Credential\ncredential = DefaultAzureCredential()\n\n# Set the API type to `azure_ad`\nos.environ[\"OPENAI_API_TYPE\"] = \"azure_ad\"\n# Set the API_KEY to the token from the Azure credential\nos.environ[\"OPENAI_API_KEY\"] = credential.get_token(\"https://cognitiveservices.azure.com/.default\").token\n\n\nThe DefaultAzureCredential class is an easy way to get started with AAD authentication. You can also customize the credential chain if necessary. In the example shown below, we first try Managed Identity, then fall back to the Azure CLI. This is useful if you are running your code in Azure, but want to develop locally.\n\nfrom azure.identity import ChainedTokenCredential, ManagedIdentityCredential, AzureCliCredential\n\ncredential = ChainedTokenCredential(\n    ManagedIdentityCredential(),\n    AzureCliCredential()\n)\n\nDeployments​\n\nWith Azure OpenAI, you set up your own deployments of the common GPT-3 and Codex models. When calling the API, you need to specify the deployment you want to use.\n\nNote: These docs are for the Azure text completion models. Models like GPT-4 are chat models. They have a slightly different interface, and can be accessed via the AzureChatOpenAI class. For docs on Azure chat see Azure Chat OpenAI documentation.\n\nLet's say your deployment name is text-davinci-002-prod. In the openai Python API, you can specify this deployment with the engine parameter. For example:\n\nimport openai\n\nresponse = openai.Completion.create(\n    engine=\"text-davinci-002-prod\",\n    prompt=\"This is a test\",\n    max_tokens=5\n)\n\npip install openai\n\nimport os\n\nos.environ[\"OPENAI_API_TYPE\"] = \"azure\"\nos.environ[\"OPENAI_API_VERSION\"] = \"2023-05-15\"\nos.environ[\"OPENAI_API_BASE\"] = \"...\"\nos.environ[\"OPENAI_API_KEY\"] = \"...\"\n\n# Import Azure OpenAI\nfrom langchain.llms import AzureOpenAI\n\n# Create an instance of Azure OpenAI\n# Replace the deployment name with your own\nllm = AzureOpenAI(\n    deployment_name=\"td2\",\n    model_name=\"text-davinci-002\",\n)\n\n# Run the LLM\nllm(\"Tell me a joke\")\n\n    \"\\n\\nWhy couldn't the bicycle stand up by itself? Because it was...two tired!\"\n\n\nWe can also print the LLM and see its custom print.\n\nprint(llm)\n\n    AzureOpenAI\n    Params: {'deployment_name': 'text-davinci-002', 'model_name': 'text-davinci-002', 'temperature': 0.7, 'max_tokens': 256, 'top_p': 1, 'frequency_penalty': 0, 'presence_penalty': 0, 'n': 1, 'best_of': 1}\n\nPrevious\nAzure ML\nNext\nBaidu Qianfan"
}