{
	"title": "Partial prompt templates | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/modules/model_io/prompts/prompt_templates/partial",
	"html": "ModulesModel I/OPromptsPrompt templatesPartial prompt templates\nPartial prompt templates\n\nLike other methods, it can make sense to \"partial\" a prompt template - e.g. pass in a subset of the required values, as to create a new prompt template which expects only the remaining subset of values.\n\nLangChain supports this in two ways:\n\nPartial formatting with string values.\nPartial formatting with functions that return string values.\n\nThese two different ways support different use cases. In the examples below, we go over the motivations for both use cases as well as how to do it in LangChain.\n\nPartial with strings​\n\nOne common use case for wanting to partial a prompt template is if you get some of the variables before others. For example, suppose you have a prompt template that requires two variables, foo and baz. If you get the foo value early on in the chain, but the baz value later, it can be annoying to wait until you have both variables in the same place to pass them to the prompt template. Instead, you can partial the prompt template with the foo value, and then pass the partialed prompt template along and just use that. Below is an example of doing this:\n\nfrom langchain.prompts import PromptTemplate\n\nprompt = PromptTemplate(template=\"{foo}{bar}\", input_variables=[\"foo\", \"bar\"])\npartial_prompt = prompt.partial(foo=\"foo\");\nprint(partial_prompt.format(bar=\"baz\"))\n\n    foobaz\n\n\nYou can also just initialize the prompt with the partialed variables.\n\nprompt = PromptTemplate(template=\"{foo}{bar}\", input_variables=[\"bar\"], partial_variables={\"foo\": \"foo\"})\nprint(prompt.format(bar=\"baz\"))\n\n    foobaz\n\nPartial with functions​\n\nThe other common use is to partial with a function. The use case for this is when you have a variable you know that you always want to fetch in a common way. A prime example of this is with date or time. Imagine you have a prompt which you always want to have the current date. You can't hard code it in the prompt, and passing it along with the other input variables is a bit annoying. In this case, it's very handy to be able to partial the prompt with a function that always returns the current date.\n\nfrom datetime import datetime\n\ndef _get_datetime():\n    now = datetime.now()\n    return now.strftime(\"%m/%d/%Y, %H:%M:%S\")\n\nprompt = PromptTemplate(\n    template=\"Tell me a {adjective} joke about the day {date}\",\n    input_variables=[\"adjective\", \"date\"]\n);\npartial_prompt = prompt.partial(date=_get_datetime)\nprint(partial_prompt.format(adjective=\"funny\"))\n\n    Tell me a funny joke about the day 02/27/2023, 22:15:16\n\n\nYou can also just initialize the prompt with the partialed variables, which often makes more sense in this workflow.\n\nprompt = PromptTemplate(\n    template=\"Tell me a {adjective} joke about the day {date}\",\n    input_variables=[\"adjective\"],\n    partial_variables={\"date\": _get_datetime}\n);\nprint(prompt.format(adjective=\"funny\"))\n\n    Tell me a funny joke about the day 02/27/2023, 22:15:16\n\nPrevious\nTypes of MessagePromptTemplate\nNext\nComposition"
}