{
	"title": "sql-llama2 | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/templates/sql-llama2",
	"html": "Templatessql-llama2\nsql-llama2\n\nThis template enables a user to interact with a SQL database using natural language.\n\nIt uses LLamA2-13b hosted by Replicate, but can be adapted to any API that supports LLaMA2 including Fireworks.\n\nThe template includes an example database of 2023 NBA rosters.\n\nFor more information on how to build this database, see here.\n\nEnvironment Setup​\n\nEnsure the REPLICATE_API_TOKEN is set in your environment.\n\nUsage​\n\nTo use this package, you should first have the LangChain CLI installed:\n\npip install -U langchain-cli\n\n\nTo create a new LangChain project and install this as the only package, you can do:\n\nlangchain app new my-app --package sql-llama2\n\n\nIf you want to add this to an existing project, you can just run:\n\nlangchain app add sql-llama2\n\n\nAnd add the following code to your server.py file:\n\nfrom sql_llama2 import chain as sql_llama2_chain\n\nadd_routes(app, sql_llama2_chain, path=\"/sql-llama2\")\n\n\n(Optional) Let's now configure LangSmith. LangSmith will help us trace, monitor and debug LangChain applications. LangSmith is currently in private beta, you can sign up here. If you don't have access, you can skip this section\n\nexport LANGCHAIN_TRACING_V2=true\nexport LANGCHAIN_API_KEY=<your-api-key>\nexport LANGCHAIN_PROJECT=<your-project>  # if not specified, defaults to \"default\"\n\n\nIf you are inside this directory, then you can spin up a LangServe instance directly by:\n\nlangchain serve\n\n\nThis will start the FastAPI app with a server is running locally at http://localhost:8000\n\nWe can see all templates at http://127.0.0.1:8000/docs We can access the playground at http://127.0.0.1:8000/sql-llama2/playground\n\nWe can access the template from code with:\n\nfrom langserve.client import RemoteRunnable\n\nrunnable = RemoteRunnable(\"http://localhost:8000/sql-llama2\")\n\nPrevious\nsolo-performance-prompting-agent\nNext\nsql-llamacpp"
}