{
	"title": "rag-matching-engine | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/templates/rag-matching-engine",
	"html": "Templatesrag-matching-engine\nrag-matching-engine\n\nThis template performs RAG using Google Cloud Platform's Vertex AI with the matching engine.\n\nIt will utilize a previously created index to retrieve relevant documents or contexts based on user-provided questions.\n\nEnvironment Setup​\n\nAn index should be created before running the code.\n\nThe process to create this index can be found here.\n\nEnvironment variables for Vertex should be set:\n\nPROJECT_ID\nME_REGION\nGCS_BUCKET\nME_INDEX_ID\nME_ENDPOINT_ID\n\nUsage​\n\nTo use this package, you should first have the LangChain CLI installed:\n\npip install -U langchain-cli\n\n\nTo create a new LangChain project and install this as the only package, you can do:\n\nlangchain app new my-app --package rag-matching-engine\n\n\nIf you want to add this to an existing project, you can just run:\n\nlangchain app add rag-matching-engine\n\n\nAnd add the following code to your server.py file:\n\nfrom rag_matching_engine import chain as rag_matching_engine_chain\n\nadd_routes(app, rag_matching_engine_chain, path=\"/rag-matching-engine\")\n\n\n(Optional) Let's now configure LangSmith. LangSmith will help us trace, monitor and debug LangChain applications. LangSmith is currently in private beta, you can sign up here. If you don't have access, you can skip this section\n\nexport LANGCHAIN_TRACING_V2=true\nexport LANGCHAIN_API_KEY=<your-api-key>\nexport LANGCHAIN_PROJECT=<your-project>  # if not specified, defaults to \"default\"\n\n\nIf you are inside this directory, then you can spin up a LangServe instance directly by:\n\nlangchain serve\n\n\nThis will start the FastAPI app with a server is running locally at http://localhost:8000\n\nWe can see all templates at http://127.0.0.1:8000/docs We can access the playground at http://127.0.0.1:8000/rag-matching-engine/playground\n\nWe can access the template from code with:\n\nfrom langserve.client import RemoteRunnable\n\nrunnable = RemoteRunnable(\"http://localhost:8000/rag-matching-engine\")\n\n\nFor more details on how to connect to the template, refer to the Jupyter notebook rag_matching_engine.\n\nPrevious\nrag-google-cloud-vertexai-search\nNext\nrag-momento-vector-index"
}