{
	"title": "Browserless | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/document_loaders/browserless",
	"html": "ComponentsDocument loadersBrowserless\nBrowserless\n\nBrowserless is a service that allows you to run headless Chrome instances in the cloud. It's a great way to run browser-based automation at scale without having to worry about managing your own infrastructure.\n\nTo use Browserless as a document loader, initialize a BrowserlessLoader instance as shown in this notebook. Note that by default, BrowserlessLoader returns the innerText of the page's body element. To disable this and get the raw HTML, set text_content to False.\n\nfrom langchain.document_loaders import BrowserlessLoader\n\nBROWSERLESS_API_TOKEN = \"YOUR_BROWSERLESS_API_TOKEN\"\n\nloader = BrowserlessLoader(\n    api_token=BROWSERLESS_API_TOKEN,\n    urls=[\n        \"https://en.wikipedia.org/wiki/Document_classification\",\n    ],\n    text_content=True,\n)\n\ndocuments = loader.load()\n\nprint(documents[0].page_content[:1000])\n\n    Jump to content\n    Main menu\n    Search\n    Create account\n    Log in\n    Personal tools\n    Toggle the table of contents\n    Document classification\n    17 languages\n    Article\n    Talk\n    Read\n    Edit\n    View history\n    Tools\n    From Wikipedia, the free encyclopedia\n    \n    Document classification or document categorization is a problem in library science, information science and computer science. The task is to assign a document to one or more classes or categories. This may be done \"manually\" (or \"intellectually\") or algorithmically. The intellectual classification of documents has mostly been the province of library science, while the algorithmic classification of documents is mainly in information science and computer science. The problems are overlapping, however, and there is therefore interdisciplinary research on document classification.\n    \n    The documents to be classified may be texts, images, music, etc. Each kind of document possesses its special classification problems. When not otherwise specified, text classification is implied.\n    \n    Do\n\nPrevious\nBrave Search\nNext\nChatGPT Data"
}