{
	"title": "Epsilla | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/vectorstores/epsilla",
	"html": "ComponentsVector storesEpsilla\nEpsilla\n\nEpsilla is an open-source vector database that leverages the advanced parallel graph traversal techniques for vector indexing. Epsilla is licensed under GPL-3.0.\n\nThis notebook shows how to use the functionalities related to the Epsilla vector database.\n\nAs a prerequisite, you need to have a running Epsilla vector database (for example, through our docker image), and install the pyepsilla package. View full docs at docs.\n\npip/pip3 install pyepsilla\n\n\nWe want to use OpenAIEmbeddings so we have to get the OpenAI API Key.\n\nimport getpass\nimport os\n\nos.environ[\"OPENAI_API_KEY\"] = getpass.getpass(\"OpenAI API Key:\")\n\n\nOpenAI API Key: ········\n\nfrom langchain.embeddings import OpenAIEmbeddings\nfrom langchain.vectorstores import Epsilla\n\nfrom langchain.document_loaders import TextLoader\nfrom langchain.text_splitter import CharacterTextSplitter\n\nloader = TextLoader(\"../../modules/state_of_the_union.txt\")\ndocuments = loader.load()\n\ndocuments = CharacterTextSplitter(chunk_size=1000, chunk_overlap=0).split_documents(\n    documents\n)\n\nembeddings = OpenAIEmbeddings()\n\n\nEpsilla vectordb is running with default host \"localhost\" and port \"8888\". We have a custom db path, db name and collection name instead of the default ones.\n\nfrom pyepsilla import vectordb\n\nclient = vectordb.Client()\nvector_store = Epsilla.from_documents(\n    documents,\n    embeddings,\n    client,\n    db_path=\"/tmp/mypath\",\n    db_name=\"MyDB\",\n    collection_name=\"MyCollection\",\n)\n\nquery = \"What did the president say about Ketanji Brown Jackson\"\ndocs = vector_store.similarity_search(query)\nprint(docs[0].page_content)\n\n\nIn state after state, new laws have been passed, not only to suppress the vote, but to subvert entire elections.\n\nWe cannot let this happen.\n\nTonight. I call on the Senate to: Pass the Freedom to Vote Act. Pass the John Lewis Voting Rights Act. And while you’re at it, pass the Disclose Act so Americans can know who is funding our elections.\n\nTonight, I’d like to honor someone who has dedicated his life to serve this country: Justice Stephen Breyer—an Army veteran, Constitutional scholar, and retiring Justice of the United States Supreme Court. Justice Breyer, thank you for your service.\n\nOne of the most serious constitutional responsibilities a President has is nominating someone to serve on the United States Supreme Court.\n\nAnd I did that 4 days ago, when I nominated Circuit Court of Appeals Judge Ketanji Brown Jackson. One of our nation’s top legal minds, who will continue Justice Breyer’s legacy of excellence.\n\nPrevious\nElasticsearch\nNext\nFaiss"
}