{
	"title": "TruLens | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/providers/trulens",
	"html": "ProvidersMoreTruLens\nTruLens\n\nThis page covers how to use TruLens to evaluate and track LLM apps built on langchain.\n\nWhat is TruLens?​\n\nTruLens is an open-source package that provides instrumentation and evaluation tools for large language model (LLM) based applications.\n\nQuick start​\n\nOnce you've created your LLM chain, you can use TruLens for evaluation and tracking. TruLens has a number of out-of-the-box Feedback Functions, and is also an extensible framework for LLM evaluation.\n\n# create a feedback function\n\nfrom trulens_eval.feedback import Feedback, Huggingface, OpenAI\n# Initialize HuggingFace-based feedback function collection class:\nhugs = Huggingface()\nopenai = OpenAI()\n\n# Define a language match feedback function using HuggingFace.\nlang_match = Feedback(hugs.language_match).on_input_output()\n# By default this will check language match on the main app input and main app\n# output.\n\n# Question/answer relevance between overall question and answer.\nqa_relevance = Feedback(openai.relevance).on_input_output()\n# By default this will evaluate feedback on main app input and main app output.\n\n# Toxicity of input\ntoxicity = Feedback(openai.toxicity).on_input()\n\n\n\nAfter you've set up Feedback Function(s) for evaluating your LLM, you can wrap your application with TruChain to get detailed tracing, logging and evaluation of your LLM app.\n\n# wrap your chain with TruChain\ntruchain = TruChain(\n    chain,\n    app_id='Chain1_ChatApplication',\n    feedbacks=[lang_match, qa_relevance, toxicity]\n)\n# Note: any `feedbacks` specified here will be evaluated and logged whenever the chain is used.\ntruchain(\"que hora es?\")\n\n\nNow you can explore your LLM-based application!\n\nDoing so will help you understand how your LLM application is performing at a glance. As you iterate new versions of your LLM application, you can compare their performance across all of the different quality metrics you've set up. You'll also be able to view evaluations at a record level, and explore the chain metadata for each record.\n\ntru.run_dashboard() # open a Streamlit app to explore\n\n\nFor more information on TruLens, visit trulens.org\n\nPrevious\nTrello\nNext\nTwitter"
}