{
	"title": "Map re-rank | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/modules/chains/document/map_rerank",
	"html": "ModulesMoreChainsDocumentsMap re-rank\nMap re-rank\n\nThe map re-rank documents chain runs an initial prompt on each document, that not only tries to complete a task but also gives a score for how certain it is in its answer. The highest scoring response is returned.\n\nRecreating with LCEL​\n\nWith LangChain Expression Language we can recreate the MapRerankDocumentsChain functionality, with the additional benefit of getting all the built-in LCEL features (batch, async, etc.) and with much more ability to customize specific parts of the chain.\n\nfrom langchain.chat_models import ChatOpenAI\nfrom langchain.output_parsers.openai_functions import PydanticOutputFunctionsParser\nfrom langchain.prompts import PromptTemplate\nfrom langchain.pydantic_v1 import BaseModel, Field\nfrom langchain.schema.prompt_template import format_document\nfrom langchain.utils.openai_functions import convert_pydantic_to_openai_function\n\n# Chain to apply to each individual document. Chain\n# provides an answer to the question based on the document\n# and scores it's confidence in the answer.\n\nmap_prompt = PromptTemplate.from_template(\n    \"Answer the user question using the context.\"\n    \"\\n\\nContext:\\n\\n{context}\\n\\nQuestion: {question}\"\n)\n\n\nclass AnswerAndScore(BaseModel):\n    \"\"\"Return the answer to the question and a relevance score.\"\"\"\n\n    answer: str = Field(\n        description=\"The answer to the question, which is based ONLY on the provided context.\"\n    )\n    score: float = Field(\n        decsription=\"A 0.0-1.0 relevance score, where 1.0 indicates the provided context answers the question completely and 0.0 indicates the provided context does not answer the question at all.\"\n    )\n\n\nfunction = convert_pydantic_to_openai_function(AnswerAndScore)\nmap_chain = (\n    map_prompt\n    | ChatOpenAI().bind(\n        temperature=0, functions=[function], function_call={\"name\": \"AnswerAndScore\"}\n    )\n    | PydanticOutputFunctionsParser(pydantic_schema=AnswerAndScore)\n).with_config(run_name=\"Map\")\n\n# Final chain, which after answer and scoring based on\n# each doc return the answer with the highest score.\n\n\ndef top_answer(scored_answers):\n    return max(scored_answers, key=lambda x: x.score).answer\n\n\ndocument_prompt = PromptTemplate.from_template(\"{page_content}\")\nmap_rerank_chain = (\n    (\n        lambda x: [\n            {\n                \"context\": format_document(doc, document_prompt),\n                \"question\": x[\"question\"],\n            }\n            for doc in x[\"docs\"]\n        ]\n    )\n    | map_chain.map()\n    | top_answer\n).with_config(run_name=\"Map rerank\")\n\nExample run​\nfrom langchain.schema import Document\n\ntext = \"\"\"Nuclear power in space is the use of nuclear power in outer space, typically either small fission systems or radioactive decay for electricity or heat. Another use is for scientific observation, as in a Mössbauer spectrometer. The most common type is a radioisotope thermoelectric generator, which has been used on many space probes and on crewed lunar missions. Small fission reactors for Earth observation satellites, such as the TOPAZ nuclear reactor, have also been flown.[1] A radioisotope heater unit is powered by radioactive decay and can keep components from becoming too cold to function, potentially over a span of decades.[2]\n\nThe United States tested the SNAP-10A nuclear reactor in space for 43 days in 1965,[3] with the next test of a nuclear reactor power system intended for space use occurring on 13 September 2012 with the Demonstration Using Flattop Fission (DUFF) test of the Kilopower reactor.[4]\n\nAfter a ground-based test of the experimental 1965 Romashka reactor, which used uranium and direct thermoelectric conversion to electricity,[5] the USSR sent about 40 nuclear-electric satellites into space, mostly powered by the BES-5 reactor. The more powerful TOPAZ-II reactor produced 10 kilowatts of electricity.[3]\n\nExamples of concepts that use nuclear power for space propulsion systems include the nuclear electric rocket (nuclear powered ion thruster(s)), the radioisotope rocket, and radioisotope electric propulsion (REP).[6] One of the more explored concepts is the nuclear thermal rocket, which was ground tested in the NERVA program. Nuclear pulse propulsion was the subject of Project Orion.[7]\n\nRegulation and hazard prevention[edit]\nAfter the ban of nuclear weapons in space by the Outer Space Treaty in 1967, nuclear power has been discussed at least since 1972 as a sensitive issue by states.[8] Particularly its potential hazards to Earth's environment and thus also humans has prompted states to adopt in the U.N. General Assembly the Principles Relevant to the Use of Nuclear Power Sources in Outer Space (1992), particularly introducing safety principles for launches and to manage their traffic.[8]\n\nBenefits\n\nBoth the Viking 1 and Viking 2 landers used RTGs for power on the surface of Mars. (Viking launch vehicle pictured)\nWhile solar power is much more commonly used, nuclear power can offer advantages in some areas. Solar cells, although efficient, can only supply energy to spacecraft in orbits where the solar flux is sufficiently high, such as low Earth orbit and interplanetary destinations close enough to the Sun. Unlike solar cells, nuclear power systems function independently of sunlight, which is necessary for deep space exploration. Nuclear-based systems can have less mass than solar cells of equivalent power, allowing more compact spacecraft that are easier to orient and direct in space. In the case of crewed spaceflight, nuclear power concepts that can power both life support and propulsion systems may reduce both cost and flight time.[9]\n\nSelected applications and/or technologies for space include:\n\nRadioisotope thermoelectric generator\nRadioisotope heater unit\nRadioisotope piezoelectric generator\nRadioisotope rocket\nNuclear thermal rocket\nNuclear pulse propulsion\nNuclear electric rocket\n\"\"\"\n\ndocs = [\n    Document(\n        page_content=split,\n        metadata={\"source\": \"https://en.wikipedia.org/wiki/Nuclear_power_in_space\"},\n    )\n    for split in text.split(\"\\n\\n\")\n]\n\nprint(\n    map_rerank_chain.invoke({\"docs\": docs, \"question\": \"How were the vikings powered\"})\n)\n\n    The Viking missions were powered by radioisotope thermoelectric generators (RTGs). These generators used the heat produced by the natural decay of plutonium-238 to generate electricity.\n\nPrevious\nMap reduce\nNext\nChains"
}