{
	"title": "rag-momento-vector-index | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/templates/rag-momento-vector-index",
	"html": "Templatesrag-momento-vector-index\nrag-momento-vector-index\n\nThis template performs RAG using Momento Vector Index (MVI) and OpenAI.\n\nMVI: the most productive, easiest to use, serverless vector index for your data. To get started with MVI, simply sign up for an account. There's no need to handle infrastructure, manage servers, or be concerned about scaling. MVI is a service that scales automatically to meet your needs. Combine with other Momento services such as Momento Cache to cache prompts and as a session store or Momento Topics as a pub/sub system to broadcast events to your application.\n\nTo sign up and access MVI, visit the Momento Console.\n\nEnvironment Setup​\n\nThis template uses Momento Vector Index as a vectorstore and requires that MOMENTO_API_KEY, and MOMENTO_INDEX_NAME are set.\n\nGo to the console to get an API key.\n\nSet the OPENAI_API_KEY environment variable to access the OpenAI models.\n\nUsage​\n\nTo use this package, you should first have the LangChain CLI installed:\n\npip install -U langchain-cli\n\n\nTo create a new LangChain project and install this as the only package, you can do:\n\nlangchain app new my-app --package rag-momento-vector-index\n\n\nIf you want to add this to an existing project, you can just run:\n\nlangchain app add rag-momento-vector-index\n\n\nAnd add the following code to your server.py file:\n\nfrom rag_momento_vector_index import chain as rag_momento_vector_index_chain\n\nadd_routes(app, rag_momento_vector_index_chain, path=\"/rag-momento-vector-index\")\n\n\n(Optional) Let's now configure LangSmith. LangSmith will help us trace, monitor and debug LangChain applications. LangSmith is currently in private beta, you can sign up here. If you don't have access, you can skip this section\n\nexport LANGCHAIN_TRACING_V2=true\nexport LANGCHAIN_API_KEY=<your-api-key>\nexport LANGCHAIN_PROJECT=<your-project>  # if not specified, defaults to \"default\"\n\n\nIf you are inside this directory, then you can spin up a LangServe instance directly by:\n\nlangchain serve\n\n\nThis will start the FastAPI app with a server is running locally at http://localhost:8000\n\nWe can see all templates at http://127.0.0.1:8000/docs We can access the playground at http://127.0.0.1:8000/rag-momento-vector-index/playground\n\nWe can access the template from code with:\n\nfrom langserve.client import RemoteRunnable\n\nrunnable = RemoteRunnable(\"http://localhost:8000/rag-momento-vector-index\")\n\nIndexing Data​\n\nWe have included a sample module to index data. That is available at rag_momento_vector_index/ingest.py. You will see a commented out line in chain.py that invokes this. Uncomment to use.\n\nPrevious\nrag-matching-engine\nNext\nrag-mongo"
}