{
	"title": "AWS Lambda | ðŸ¦œï¸ðŸ”— Langchain",
	"url": "https://python.langchain.com/docs/integrations/tools/awslambda",
	"html": "ComponentsToolsAWS Lambda\nAWS Lambda\n\nAmazon AWS Lambda is a serverless computing service provided by Amazon Web Services (AWS). It helps developers to build and run applications and services without provisioning or managing servers. This serverless architecture enables you to focus on writing and deploying code, while AWS automatically takes care of scaling, patching, and managing the infrastructure required to run your applications.\n\nThis notebook goes over how to use the AWS Lambda Tool.\n\nBy including a awslambda in the list of tools provided to an Agent, you can grant your Agent the ability to invoke code running in your AWS Cloud for whatever purposes you need.\n\nWhen an Agent uses the AWS Lambda tool, it will provide an argument of type string which will in turn be passed into the Lambda function via the event parameter.\n\nFirst, you need to install boto3 python package.\n\npip install boto3 > /dev/null\n\n\nIn order for an agent to use the tool, you must provide it with the name and description that match the functionality of you lambda function's logic.\n\nYou must also provide the name of your function.\n\nNote that because this tool is effectively just a wrapper around the boto3 library, you will need to run aws configure in order to make use of the tool. For more detail, see here\n\nfrom langchain.agents import AgentType, initialize_agent, load_tools\nfrom langchain.llms import OpenAI\n\nllm = OpenAI(temperature=0)\n\ntools = load_tools(\n    [\"awslambda\"],\n    awslambda_tool_name=\"email-sender\",\n    awslambda_tool_description=\"sends an email with the specified content to test@testing123.com\",\n    function_name=\"testFunction1\",\n)\n\nagent = initialize_agent(\n    tools, llm, agent=AgentType.ZERO_SHOT_REACT_DESCRIPTION, verbose=True\n)\n\nagent.run(\"Send an email to test@testing123.com saying hello world.\")\n\nPrevious\nArXiv\nNext\nShell (bash)"
}