{
	"title": "Nuclia | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/document_loaders/nuclia",
	"html": "ComponentsDocument loadersNuclia\nNuclia\n\nNuclia automatically indexes your unstructured data from any internal and external source, providing optimized search results and generative answers. It can handle video and audio transcription, image content extraction, and document parsing.\n\nThe Nuclia Understanding API supports the processing of unstructured data, including text, web pages, documents, and audio/video contents. It extracts all texts wherever they are (using speech-to-text or OCR when needed), it also extracts metadata, embedded files (like images in a PDF), and web links. If machine learning is enabled, it identifies entities, provides a summary of the content and generates embeddings for all the sentences.\n\nSetup​\n\nTo use the Nuclia Understanding API, you need to have a Nuclia account. You can create one for free at https://nuclia.cloud, and then create a NUA key.\n\n#!pip install --upgrade protobuf\n#!pip install nucliadb-protos\n\nimport os\n\nos.environ[\"NUCLIA_ZONE\"] = \"<YOUR_ZONE>\"  # e.g. europe-1\nos.environ[\"NUCLIA_NUA_KEY\"] = \"<YOUR_API_KEY>\"\n\nExample​\n\nTo use the Nuclia document loader, you need to instantiate a NucliaUnderstandingAPI tool:\n\nfrom langchain.tools.nuclia import NucliaUnderstandingAPI\n\nnua = NucliaUnderstandingAPI(enable_ml=False)\n\nfrom langchain.document_loaders.nuclia import NucliaLoader\n\nloader = NucliaLoader(\"./interview.mp4\", nua)\n\n\nYou can now call the load the document in a loop until you get the document.\n\nimport time\n\npending = True\nwhile pending:\n    time.sleep(15)\n    docs = loader.load()\n    if len(docs) > 0:\n        print(docs[0].page_content)\n        print(docs[0].metadata)\n        pending = False\n    else:\n        print(\"waiting...\")\n\nRetrieved information​\n\nNuclia returns the following information:\n\nfile metadata\nextracted text\nnested text (like text in an embedded image)\nparagraphs and sentences splitting (defined by the position of their first and last characters, plus start time and end time for a video or audio file)\nlinks\na thumbnail\nembedded files\n\nNote:\n\nGenerated files (thumbnail, extracted embedded files, etc.) are provided as a token. You can download them with the /processing/download endpoint.\n\nAlso at any level, if an attribute exceeds a certain size, it will be put in a downloadable file and will be replaced in the document by a file pointer. This will consist of {\"file\": {\"uri\": \"JWT_TOKEN\"}}. The rule is that if the size of the message is greater than 1000000 characters, the biggest parts will be moved to downloadable files. First, the compression process will target vectors. If that is not enough, it will target large field metadata, and finally it will target extracted text.\n\nPrevious\nNotion DB 2/2\nNext\nObsidian"
}