{
	"title": "rag-astradb | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/templates/rag-astradb",
	"html": "Templatesrag-astradb\nrag-astradb\n\nThis template will perform RAG using Astra DB (AstraDB vector store class)\n\nEnvironment Setup​\n\nAn Astra DB database is required; free tier is fine.\n\nYou need the database API endpoint (such as https://0123...-us-east1.apps.astra.datastax.com) ...\n... and a token (AstraCS:...).\n\nAlso, an OpenAI API Key is required. Note that out-of-the-box this demo supports OpenAI only, unless you tinker with the code.\n\nProvide the connection parameters and secrets through environment variables. Please refer to .env.template for the variable names.\n\nUsage​\n\nTo use this package, you should first have the LangChain CLI installed:\n\npip install -U \"langchain-cli[serve]\"\n\n\nTo create a new LangChain project and install this as the only package, you can do:\n\nlangchain app new my-app --package rag-astradb\n\n\nIf you want to add this to an existing project, you can just run:\n\nlangchain app add rag-astradb\n\n\nAnd add the following code to your server.py file:\n\nfrom astradb_entomology_rag import chain as astradb_entomology_rag_chain\n\nadd_routes(app, astradb_entomology_rag_chain, path=\"/rag-astradb\")\n\n\n(Optional) Let's now configure LangSmith. LangSmith will help us trace, monitor and debug LangChain applications. LangSmith is currently in private beta, you can sign up here. If you don't have access, you can skip this section\n\nexport LANGCHAIN_TRACING_V2=true\nexport LANGCHAIN_API_KEY=<your-api-key>\nexport LANGCHAIN_PROJECT=<your-project>  # if not specified, defaults to \"default\"\n\n\nIf you are inside this directory, then you can spin up a LangServe instance directly by:\n\nlangchain serve\n\n\nThis will start the FastAPI app with a server is running locally at http://localhost:8000\n\nWe can see all templates at http://127.0.0.1:8000/docs We can access the playground at http://127.0.0.1:8000/rag-astradb/playground\n\nWe can access the template from code with:\n\nfrom langserve.client import RemoteRunnable\n\nrunnable = RemoteRunnable(\"http://localhost:8000/rag-astradb\")\n\nReference​\n\nStand-alone repo with LangServe chain: here.\n\nPrevious\nplate-chain\nNext\nrag-aws-bedrock"
}