{
	"title": "GraphQL | ðŸ¦œï¸ðŸ”— Langchain",
	"url": "https://python.langchain.com/docs/integrations/tools/graphql",
	"html": "ComponentsToolsGraphQL\nGraphQL\n\nGraphQL is a query language for APIs and a runtime for executing those queries against your data. GraphQL provides a complete and understandable description of the data in your API, gives clients the power to ask for exactly what they need and nothing more, makes it easier to evolve APIs over time, and enables powerful developer tools.\n\nBy including a BaseGraphQLTool in the list of tools provided to an Agent, you can grant your Agent the ability to query data from GraphQL APIs for any purposes you need.\n\nThis Jupyter Notebook demonstrates how to use the GraphQLAPIWrapper component with an Agent.\n\nIn this example, we'll be using the public Star Wars GraphQL API available at the following endpoint: https://swapi-graphql.netlify.app/.netlify/functions/index.\n\nFirst, you need to install httpx and gql Python packages.\n\npip install httpx gql > /dev/null\n\n\nNow, let's create a BaseGraphQLTool instance with the specified Star Wars API endpoint and initialize an Agent with the tool.\n\nfrom langchain.agents import AgentType, initialize_agent, load_tools\nfrom langchain.llms import OpenAI\n\nllm = OpenAI(temperature=0)\n\ntools = load_tools(\n    [\"graphql\"],\n    graphql_endpoint=\"https://swapi-graphql.netlify.app/.netlify/functions/index\",\n)\n\nagent = initialize_agent(\n    tools, llm, agent=AgentType.ZERO_SHOT_REACT_DESCRIPTION, verbose=True\n)\n\n\nNow, we can use the Agent to run queries against the Star Wars GraphQL API. Let's ask the Agent to list all the Star Wars films and their release dates.\n\ngraphql_fields = \"\"\"allFilms {\n    films {\n      title\n      director\n      releaseDate\n      speciesConnection {\n        species {\n          name\n          classification\n          homeworld {\n            name\n          }\n        }\n      }\n    }\n  }\n\n\"\"\"\n\nsuffix = \"Search for the titles of all the stawars films stored in the graphql database that has this schema \"\n\n\nagent.run(suffix + graphql_fields)\n\n    \n    \n    > Entering new AgentExecutor chain...\n     I need to query the graphql database to get the titles of all the star wars films\n    Action: query_graphql\n    Action Input: query { allFilms { films { title } } }\n    Observation: \"{\\n  \\\"allFilms\\\": {\\n    \\\"films\\\": [\\n      {\\n        \\\"title\\\": \\\"A New Hope\\\"\\n      },\\n      {\\n        \\\"title\\\": \\\"The Empire Strikes Back\\\"\\n      },\\n      {\\n        \\\"title\\\": \\\"Return of the Jedi\\\"\\n      },\\n      {\\n        \\\"title\\\": \\\"The Phantom Menace\\\"\\n      },\\n      {\\n        \\\"title\\\": \\\"Attack of the Clones\\\"\\n      },\\n      {\\n        \\\"title\\\": \\\"Revenge of the Sith\\\"\\n      }\\n    ]\\n  }\\n}\"\n    Thought: I now know the titles of all the star wars films\n    Final Answer: The titles of all the star wars films are: A New Hope, The Empire Strikes Back, Return of the Jedi, The Phantom Menace, Attack of the Clones, and Revenge of the Sith.\n    \n    > Finished chain.\n\n\n\n\n\n    'The titles of all the star wars films are: A New Hope, The Empire Strikes Back, Return of the Jedi, The Phantom Menace, Attack of the Clones, and Revenge of the Sith.'\n\nPrevious\nGradio\nNext\nHuggingFace Hub Tools"
}