{
	"title": "Cohere Reranker | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/retrievers/cohere-reranker",
	"html": "ComponentsRetrieversCohere Reranker\nCohere Reranker\n\nCohere is a Canadian startup that provides natural language processing models that help companies improve human-machine interactions.\n\nThis notebook shows how to use Cohere's rerank endpoint in a retriever. This builds on top of ideas in the ContextualCompressionRetriever.\n\n#!pip install cohere\n\n#!pip install faiss\n\n# OR  (depending on Python version)\n\n#!pip install faiss-cpu\n\n# get a new token: https://dashboard.cohere.ai/\n\nimport getpass\nimport os\n\nos.environ[\"COHERE_API_KEY\"] = getpass.getpass(\"Cohere API Key:\")\n\nos.environ[\"OPENAI_API_KEY\"] = getpass.getpass(\"OpenAI API Key:\")\n\n# Helper function for printing docs\n\n\ndef pretty_print_docs(docs):\n    print(\n        f\"\\n{'-' * 100}\\n\".join(\n            [f\"Document {i+1}:\\n\\n\" + d.page_content for i, d in enumerate(docs)]\n        )\n    )\n\nSet up the base vector store retriever​\n\nLet's start by initializing a simple vector store retriever and storing the 2023 State of the Union speech (in chunks). We can set up the retriever to retrieve a high number (20) of docs.\n\nfrom langchain.document_loaders import TextLoader\nfrom langchain.embeddings import OpenAIEmbeddings\nfrom langchain.text_splitter import RecursiveCharacterTextSplitter\nfrom langchain.vectorstores import FAISS\n\ndocuments = TextLoader(\"../../modules/state_of_the_union.txt\").load()\ntext_splitter = RecursiveCharacterTextSplitter(chunk_size=500, chunk_overlap=100)\ntexts = text_splitter.split_documents(documents)\nretriever = FAISS.from_documents(texts, OpenAIEmbeddings()).as_retriever(\n    search_kwargs={\"k\": 20}\n)\n\nquery = \"What did the president say about Ketanji Brown Jackson\"\ndocs = retriever.get_relevant_documents(query)\npretty_print_docs(docs)\n\n    Document 1:\n    \n    One of the most serious constitutional responsibilities a President has is nominating someone to serve on the United States Supreme Court. \n    \n    And I did that 4 days ago, when I nominated Circuit Court of Appeals Judge Ketanji Brown Jackson. One of our nation’s top legal minds, who will continue Justice Breyer’s legacy of excellence.\n    ----------------------------------------------------------------------------------------------------\n    Document 2:\n    \n    As I said last year, especially to our younger transgender Americans, I will always have your back as your President, so you can be yourself and reach your God-given potential. \n    \n    While it often appears that we never agree, that isn’t true. I signed 80 bipartisan bills into law last year. From preventing government shutdowns to protecting Asian-Americans from still-too-common hate crimes to reforming military justice.\n    ----------------------------------------------------------------------------------------------------\n    Document 3:\n    \n    A former top litigator in private practice. A former federal public defender. And from a family of public school educators and police officers. A consensus builder. Since she’s been nominated, she’s received a broad range of support—from the Fraternal Order of Police to former judges appointed by Democrats and Republicans. \n    \n    And if we are to advance liberty and justice, we need to secure the Border and fix the immigration system.\n    ----------------------------------------------------------------------------------------------------\n    Document 4:\n    \n    He met the Ukrainian people. \n    \n    From President Zelenskyy to every Ukrainian, their fearlessness, their courage, their determination, inspires the world. \n    \n    Groups of citizens blocking tanks with their bodies. Everyone from students to retirees teachers turned soldiers defending their homeland. \n    \n    In this struggle as President Zelenskyy said in his speech to the European Parliament “Light will win over darkness.” The Ukrainian Ambassador to the United States is here tonight.\n    ----------------------------------------------------------------------------------------------------\n    Document 5:\n    \n    I spoke with their families and told them that we are forever in debt for their sacrifice, and we will carry on their mission to restore the trust and safety every community deserves. \n    \n    I’ve worked on these issues a long time. \n    \n    I know what works: Investing in crime prevention and community police officers who’ll walk the beat, who’ll know the neighborhood, and who can restore trust and safety. \n    \n    So let’s not abandon our streets. Or choose between safety and equal justice.\n    ----------------------------------------------------------------------------------------------------\n    Document 6:\n    \n    Vice President Harris and I ran for office with a new economic vision for America. \n    \n    Invest in America. Educate Americans. Grow the workforce. Build the economy from the bottom up  \n    and the middle out, not from the top down.  \n    \n    Because we know that when the middle class grows, the poor have a ladder up and the wealthy do very well. \n    \n    America used to have the best roads, bridges, and airports on Earth. \n    \n    Now our infrastructure is ranked 13th in the world.\n    ----------------------------------------------------------------------------------------------------\n    Document 7:\n    \n    And tonight, I’m announcing that the Justice Department will name a chief prosecutor for pandemic fraud. \n    \n    By the end of this year, the deficit will be down to less than half what it was before I took office.  \n    \n    The only president ever to cut the deficit by more than one trillion dollars in a single year. \n    \n    Lowering your costs also means demanding more competition. \n    \n    I’m a capitalist, but capitalism without competition isn’t capitalism. \n    \n    It’s exploitation—and it drives up prices.\n    ----------------------------------------------------------------------------------------------------\n    Document 8:\n    \n    For the past 40 years we were told that if we gave tax breaks to those at the very top, the benefits would trickle down to everyone else. \n    \n    But that trickle-down theory led to weaker economic growth, lower wages, bigger deficits, and the widest gap between those at the top and everyone else in nearly a century. \n    \n    Vice President Harris and I ran for office with a new economic vision for America.\n    ----------------------------------------------------------------------------------------------------\n    Document 9:\n    \n    All told, we created 369,000 new manufacturing jobs in America just last year. \n    \n    Powered by people I’ve met like JoJo Burgess, from generations of union steelworkers from Pittsburgh, who’s here with us tonight. \n    \n    As Ohio Senator Sherrod Brown says, “It’s time to bury the label “Rust Belt.” \n    \n    It’s time. \n    \n    But with all the bright spots in our economy, record job growth and higher wages, too many families are struggling to keep up with the bills.\n    ----------------------------------------------------------------------------------------------------\n    Document 10:\n    \n    I’m also calling on Congress: pass a law to make sure veterans devastated by toxic exposures in Iraq and Afghanistan finally get the benefits and comprehensive health care they deserve. \n    \n    And fourth, let’s end cancer as we know it. \n    \n    This is personal to me and Jill, to Kamala, and to so many of you. \n    \n    Cancer is the #2 cause of death in America–second only to heart disease.\n    ----------------------------------------------------------------------------------------------------\n    Document 11:\n    \n    He will never extinguish their love of freedom. He will never weaken the resolve of the free world. \n    \n    We meet tonight in an America that has lived through two of the hardest years this nation has ever faced. \n    \n    The pandemic has been punishing. \n    \n    And so many families are living paycheck to paycheck, struggling to keep up with the rising cost of food, gas, housing, and so much more. \n    \n    I understand.\n    ----------------------------------------------------------------------------------------------------\n    Document 12:\n    \n    Madam Speaker, Madam Vice President, our First Lady and Second Gentleman. Members of Congress and the Cabinet. Justices of the Supreme Court. My fellow Americans.  \n    \n    Last year COVID-19 kept us apart. This year we are finally together again. \n    \n    Tonight, we meet as Democrats Republicans and Independents. But most importantly as Americans. \n    \n    With a duty to one another to the American people to the Constitution. \n    \n    And with an unwavering resolve that freedom will always triumph over tyranny.\n    ----------------------------------------------------------------------------------------------------\n    Document 13:\n    \n    I know. \n    \n    One of those soldiers was my son Major Beau Biden. \n    \n    We don’t know for sure if a burn pit was the cause of his brain cancer, or the diseases of so many of our troops. \n    \n    But I’m committed to finding out everything we can. \n    \n    Committed to military families like Danielle Robinson from Ohio. \n    \n    The widow of Sergeant First Class Heath Robinson.  \n    \n    He was born a soldier. Army National Guard. Combat medic in Kosovo and Iraq.\n    ----------------------------------------------------------------------------------------------------\n    Document 14:\n    \n    And soon, we’ll strengthen the Violence Against Women Act that I first wrote three decades ago. It is important for us to show the nation that we can come together and do big things. \n    \n    So tonight I’m offering a Unity Agenda for the Nation. Four big things we can do together.  \n    \n    First, beat the opioid epidemic. \n    \n    There is so much we can do. Increase funding for prevention, treatment, harm reduction, and recovery.\n    ----------------------------------------------------------------------------------------------------\n    Document 15:\n    \n    Third, support our veterans. \n    \n    Veterans are the best of us. \n    \n    I’ve always believed that we have a sacred obligation to equip all those we send to war and care for them and their families when they come home. \n    \n    My administration is providing assistance with job training and housing, and now helping lower-income veterans get VA care debt-free.  \n    \n    Our troops in Iraq and Afghanistan faced many dangers.\n    ----------------------------------------------------------------------------------------------------\n    Document 16:\n    \n    When we invest in our workers, when we build the economy from the bottom up and the middle out together, we can do something we haven’t done in a long time: build a better America. \n    \n    For more than two years, COVID-19 has impacted every decision in our lives and the life of the nation. \n    \n    And I know you’re tired, frustrated, and exhausted. \n    \n    But I also know this.\n    ----------------------------------------------------------------------------------------------------\n    Document 17:\n    \n    Now is the hour. \n    \n    Our moment of responsibility. \n    \n    Our test of resolve and conscience, of history itself. \n    \n    It is in this moment that our character is formed. Our purpose is found. Our future is forged. \n    \n    Well I know this nation.  \n    \n    We will meet the test. \n    \n    To protect freedom and liberty, to expand fairness and opportunity. \n    \n    We will save democracy. \n    \n    As hard as these times have been, I am more optimistic about America today than I have been my whole life.\n    ----------------------------------------------------------------------------------------------------\n    Document 18:\n    \n    He didn’t know how to stop fighting, and neither did she. \n    \n    Through her pain she found purpose to demand we do better. \n    \n    Tonight, Danielle—we are. \n    \n    The VA is pioneering new ways of linking toxic exposures to diseases, already helping more veterans get benefits. \n    \n    And tonight, I’m announcing we’re expanding eligibility to veterans suffering from nine respiratory cancers.\n    ----------------------------------------------------------------------------------------------------\n    Document 19:\n    \n    I understand. \n    \n    I remember when my Dad had to leave our home in Scranton, Pennsylvania to find work. I grew up in a family where if the price of food went up, you felt it. \n    \n    That’s why one of the first things I did as President was fight to pass the American Rescue Plan.  \n    \n    Because people were hurting. We needed to act, and we did. \n    \n    Few pieces of legislation have done more in a critical moment in our history to lift us out of crisis.\n    ----------------------------------------------------------------------------------------------------\n    Document 20:\n    \n    So let’s not abandon our streets. Or choose between safety and equal justice. \n    \n    Let’s come together to protect our communities, restore trust, and hold law enforcement accountable. \n    \n    That’s why the Justice Department required body cameras, banned chokeholds, and restricted no-knock warrants for its officers.\n\nDoing reranking with CohereRerank​\n\nNow let's wrap our base retriever with a ContextualCompressionRetriever. We'll add an CohereRerank, uses the Cohere rerank endpoint to rerank the returned results.\n\nfrom langchain.llms import OpenAI\nfrom langchain.retrievers import ContextualCompressionRetriever\nfrom langchain.retrievers.document_compressors import CohereRerank\n\nllm = OpenAI(temperature=0)\ncompressor = CohereRerank()\ncompression_retriever = ContextualCompressionRetriever(\n    base_compressor=compressor, base_retriever=retriever\n)\n\ncompressed_docs = compression_retriever.get_relevant_documents(\n    \"What did the president say about Ketanji Jackson Brown\"\n)\npretty_print_docs(compressed_docs)\n\n    Document 1:\n    \n    One of the most serious constitutional responsibilities a President has is nominating someone to serve on the United States Supreme Court. \n    \n    And I did that 4 days ago, when I nominated Circuit Court of Appeals Judge Ketanji Brown Jackson. One of our nation’s top legal minds, who will continue Justice Breyer’s legacy of excellence.\n    ----------------------------------------------------------------------------------------------------\n    Document 2:\n    \n    I spoke with their families and told them that we are forever in debt for their sacrifice, and we will carry on their mission to restore the trust and safety every community deserves. \n    \n    I’ve worked on these issues a long time. \n    \n    I know what works: Investing in crime prevention and community police officers who’ll walk the beat, who’ll know the neighborhood, and who can restore trust and safety. \n    \n    So let’s not abandon our streets. Or choose between safety and equal justice.\n    ----------------------------------------------------------------------------------------------------\n    Document 3:\n    \n    A former top litigator in private practice. A former federal public defender. And from a family of public school educators and police officers. A consensus builder. Since she’s been nominated, she’s received a broad range of support—from the Fraternal Order of Police to former judges appointed by Democrats and Republicans. \n    \n    And if we are to advance liberty and justice, we need to secure the Border and fix the immigration system.\n\n\nYou can of course use this retriever within a QA pipeline\n\nfrom langchain.chains import RetrievalQA\n\nchain = RetrievalQA.from_chain_type(\n    llm=OpenAI(temperature=0), retriever=compression_retriever\n)\n\nchain({\"query\": query})\n\n    {'query': 'What did the president say about Ketanji Brown Jackson',\n     'result': \" The president said that Ketanji Brown Jackson is one of the nation's top legal minds and that she is a consensus builder who has received a broad range of support from the Fraternal Order of Police to former judges appointed by Democrats and Republicans.\"}\n\nPrevious\nChatGPT Plugin\nNext\nCohere RAG retriever"
}