{
	"title": "Clarifai | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/providers/clarifai",
	"html": "ProvidersMoreClarifai\nClarifai\n\nClarifai is one of first deep learning platforms having been founded in 2013. Clarifai provides an AI platform with the full AI lifecycle for data exploration, data labeling, model training, evaluation and inference around images, video, text and audio data. In the LangChain ecosystem, as far as we're aware, Clarifai is the only provider that supports LLMs, embeddings and a vector store in one production scale platform, making it an excellent choice to operationalize your LangChain implementations.\n\nInstallation and Setup​\nInstall the Python SDK:\npip install clarifai\n\n\nSign-up for a Clarifai account, then get a personal access token to access the Clarifai API from your security settings and set it as an environment variable (CLARIFAI_PAT).\n\nModels​\n\nClarifai provides 1,000s of AI models for many different use cases. You can explore them here to find the one most suited for your use case. These models include those created by other providers such as OpenAI, Anthropic, Cohere, AI21, etc. as well as state of the art from open source such as Falcon, InstructorXL, etc. so that you build the best in AI into your products. You'll find these organized by the creator's user_id and into projects we call applications denoted by their app_id. Those IDs will be needed in additional to the model_id and optionally the version_id, so make note of all these IDs once you found the best model for your use case!\n\nAlso note that given there are many models for images, video, text and audio understanding, you can build some interested AI agents that utilize the variety of AI models as experts to understand those data types.\n\nLLMs​\n\nTo find the selection of LLMs in the Clarifai platform you can select the text to text model type here.\n\nfrom langchain.llms import Clarifai\nllm = Clarifai(pat=CLARIFAI_PAT, user_id=USER_ID, app_id=APP_ID, model_id=MODEL_ID)\n\n\nFor more details, the docs on the Clarifai LLM wrapper provide a detailed walkthrough.\n\nText Embedding Models​\n\nTo find the selection of text embeddings models in the Clarifai platform you can select the text to embedding model type here.\n\nThere is a Clarifai Embedding model in LangChain, which you can access with:\n\nfrom langchain.embeddings import ClarifaiEmbeddings\nembeddings = ClarifaiEmbeddings(pat=CLARIFAI_PAT, user_id=USER_ID, app_id=APP_ID, model_id=MODEL_ID)\n\n\nFor more details, the docs on the Clarifai Embeddings wrapper provide a detailed walkthrough.\n\nVectorstore​\n\nClarifai's vector DB was launched in 2016 and has been optimized to support live search queries. With workflows in the Clarifai platform, you data is automatically indexed by am embedding model and optionally other models as well to index that information in the DB for search. You can query the DB not only via the vectors but also filter by metadata matches, other AI predicted concepts, and even do geo-coordinate search. Simply create an application, select the appropriate base workflow for your type of data, and upload it (through the API as documented here or the UIs at clarifai.com).\n\nYou can also add data directly from LangChain as well, and the auto-indexing will take place for you. You'll notice this is a little different than other vectorstores where you need to provide an embedding model in their constructor and have LangChain coordinate getting the embeddings from text and writing those to the index. Not only is it more convenient, but it's much more scalable to use Clarifai's distributed cloud to do all the index in the background.\n\nfrom langchain.vectorstores import Clarifai\nclarifai_vector_db = Clarifai.from_texts(user_id=USER_ID, app_id=APP_ID, texts=texts, pat=CLARIFAI_PAT, number_of_docs=NUMBER_OF_DOCS, metadatas = metadatas)\n\n\nFor more details, the docs on the Clarifai vector store provide a detailed walkthrough.\n\nPrevious\nChroma\nNext\nClearML"
}