{
	"title": "Neo4j | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/integrations/providers/neo4j",
	"html": "ProvidersMoreNeo4j\nNeo4j\n\nThis page covers how to use the Neo4j ecosystem within LangChain.\n\nWhat is Neo4j?\n\nNeo4j in a nutshell:\n\nNeo4j is an open-source database management system that specializes in graph database technology.\nNeo4j allows you to represent and store data in nodes and edges, making it ideal for handling connected data and relationships.\nNeo4j provides a Cypher Query Language, making it easy to interact with and query your graph data.\nWith Neo4j, you can achieve high-performance graph traversals and queries, suitable for production-level systems.\nGet started quickly with Neo4j by visiting their website.\nInstallation and Setup​\nInstall the Python SDK with pip install neo4j\nWrappers​\nVectorStore​\n\nThere exists a wrapper around Neo4j vector index, allowing you to use it as a vectorstore, whether for semantic search or example selection.\n\nTo import this vectorstore:\n\nfrom langchain.vectorstores import Neo4jVector\n\n\nFor a more detailed walkthrough of the Neo4j vector index wrapper, see documentation\n\nGraphCypherQAChain​\n\nThere exists a wrapper around Neo4j graph database that allows you to generate Cypher statements based on the user input and use them to retrieve relevant information from the database.\n\nfrom langchain.graphs import Neo4jGraph\nfrom langchain.chains import GraphCypherQAChain\n\n\nFor a more detailed walkthrough of Cypher generating chain, see documentation\n\nConstructing a knowledge graph from text​\n\nText data often contain rich relationships and insights that can be useful for various analytics, recommendation engines, or knowledge management applications. Diffbot's NLP API allows for the extraction of entities, relationships, and semantic meaning from unstructured text data. By coupling Diffbot's NLP API with Neo4j, a graph database, you can create powerful, dynamic graph structures based on the information extracted from text. These graph structures are fully queryable and can be integrated into various applications.\n\nfrom langchain.graphs import Neo4jGraph\nfrom langchain_experimental.graph_transformers.diffbot import DiffbotGraphTransformer\n\n\nFor a more detailed walkthrough generating graphs from text, see documentation\n\nPrevious\nMyScale\nNext\nNLPCloud"
}