{
	"title": "Multiple chains | 🦜️🔗 Langchain",
	"url": "https://python.langchain.com/docs/expression_language/cookbook/multiple_chains",
	"html": "LangChain Expression LanguageCookbookMultiple chains\nMultiple chains\n\nRunnables can easily be used to string together multiple Chains\n\nfrom operator import itemgetter\n\nfrom langchain.chat_models import ChatOpenAI\nfrom langchain.prompts import ChatPromptTemplate\nfrom langchain.schema import StrOutputParser\n\nprompt1 = ChatPromptTemplate.from_template(\"what is the city {person} is from?\")\nprompt2 = ChatPromptTemplate.from_template(\n    \"what country is the city {city} in? respond in {language}\"\n)\n\nmodel = ChatOpenAI()\n\nchain1 = prompt1 | model | StrOutputParser()\n\nchain2 = (\n    {\"city\": chain1, \"language\": itemgetter(\"language\")}\n    | prompt2\n    | model\n    | StrOutputParser()\n)\n\nchain2.invoke({\"person\": \"obama\", \"language\": \"spanish\"})\n\n    'El país donde se encuentra la ciudad de Honolulu, donde nació Barack Obama, el 44º Presidente de los Estados Unidos, es Estados Unidos. Honolulu se encuentra en la isla de Oahu, en el estado de Hawái.'\n\nfrom langchain.schema.runnable import RunnablePassthrough\n\nprompt1 = ChatPromptTemplate.from_template(\n    \"generate a {attribute} color. Return the name of the color and nothing else:\"\n)\nprompt2 = ChatPromptTemplate.from_template(\n    \"what is a fruit of color: {color}. Return the name of the fruit and nothing else:\"\n)\nprompt3 = ChatPromptTemplate.from_template(\n    \"what is a country with a flag that has the color: {color}. Return the name of the country and nothing else:\"\n)\nprompt4 = ChatPromptTemplate.from_template(\n    \"What is the color of {fruit} and the flag of {country}?\"\n)\n\nmodel_parser = model | StrOutputParser()\n\ncolor_generator = (\n    {\"attribute\": RunnablePassthrough()} | prompt1 | {\"color\": model_parser}\n)\ncolor_to_fruit = prompt2 | model_parser\ncolor_to_country = prompt3 | model_parser\nquestion_generator = (\n    color_generator | {\"fruit\": color_to_fruit, \"country\": color_to_country} | prompt4\n)\n\nquestion_generator.invoke(\"warm\")\n\n    ChatPromptValue(messages=[HumanMessage(content='What is the color of strawberry and the flag of China?', additional_kwargs={}, example=False)])\n\nprompt = question_generator.invoke(\"warm\")\nmodel.invoke(prompt)\n\n    AIMessage(content='The color of an apple is typically red or green. The flag of China is predominantly red with a large yellow star in the upper left corner and four smaller yellow stars surrounding it.', additional_kwargs={}, example=False)\n\nBranching and Merging​\n\nYou may want the output of one component to be processed by 2 or more other components. RunnableMaps let you split or fork the chain so multiple components can process the input in parallel. Later, other components can join or merge the results to synthesize a final response. This type of chain creates a computation graph that looks like the following:\n\n     Input\n      / \\\n     /   \\\n Branch1 Branch2\n     \\   /\n      \\ /\n      Combine\n\nplanner = (\n    ChatPromptTemplate.from_template(\"Generate an argument about: {input}\")\n    | ChatOpenAI()\n    | StrOutputParser()\n    | {\"base_response\": RunnablePassthrough()}\n)\n\narguments_for = (\n    ChatPromptTemplate.from_template(\n        \"List the pros or positive aspects of {base_response}\"\n    )\n    | ChatOpenAI()\n    | StrOutputParser()\n)\narguments_against = (\n    ChatPromptTemplate.from_template(\n        \"List the cons or negative aspects of {base_response}\"\n    )\n    | ChatOpenAI()\n    | StrOutputParser()\n)\n\nfinal_responder = (\n    ChatPromptTemplate.from_messages(\n        [\n            (\"ai\", \"{original_response}\"),\n            (\"human\", \"Pros:\\n{results_1}\\n\\nCons:\\n{results_2}\"),\n            (\"system\", \"Generate a final response given the critique\"),\n        ]\n    )\n    | ChatOpenAI()\n    | StrOutputParser()\n)\n\nchain = (\n    planner\n    | {\n        \"results_1\": arguments_for,\n        \"results_2\": arguments_against,\n        \"original_response\": itemgetter(\"base_response\"),\n    }\n    | final_responder\n)\n\nchain.invoke({\"input\": \"scrum\"})\n\n    'While Scrum has its potential cons and challenges, many organizations have successfully embraced and implemented this project management framework to great effect. The cons mentioned above can be mitigated or overcome with proper training, support, and a commitment to continuous improvement. It is also important to note that not all cons may be applicable to every organization or project.\\n\\nFor example, while Scrum may be complex initially, with proper training and guidance, teams can quickly grasp the concepts and practices. The lack of predictability can be mitigated by implementing techniques such as velocity tracking and release planning. The limited documentation can be addressed by maintaining a balance between lightweight documentation and clear communication among team members. The dependency on team collaboration can be improved through effective communication channels and regular team-building activities.\\n\\nScrum can be scaled and adapted to larger projects by using frameworks like Scrum of Scrums or LeSS (Large Scale Scrum). Concerns about speed versus quality can be addressed by incorporating quality assurance practices, such as continuous integration and automated testing, into the Scrum process. Scope creep can be managed by having a well-defined and prioritized product backlog, and a strong product owner can be developed through training and mentorship.\\n\\nResistance to change can be overcome by providing proper education and communication to stakeholders and involving them in the decision-making process. Ultimately, the cons of Scrum can be seen as opportunities for growth and improvement, and with the right mindset and support, they can be effectively managed.\\n\\nIn conclusion, while Scrum may have its challenges and potential cons, the benefits and advantages it offers in terms of collaboration, flexibility, adaptability, transparency, and customer satisfaction make it a widely adopted and successful project management framework. With proper implementation and continuous improvement, organizations can leverage Scrum to drive innovation, efficiency, and project success.'\n\nPrevious\nRAG\nNext\nQuerying a SQL DB"
}